<script setup>
import { ref } from "vue";
import { useRoute } from "vue-router";
import WishResultCard from "../components/WishResultCard.vue";

const route = useRoute();
const signData = ref();
const stateId = route?.query["stateId"];

if (!stateId || stateId === "test") {
  signData.value = {
    confirmed_wish: "希望获得完美的人生体验",
    score: 10,
    realization_scenario: "经过精心规划和逻辑严谨的思考，愿望已成功实现",
  };
} else {
  const rawSignData = sessionStorage.getItem(stateId);
  if (!rawSignData) {
    signData.value = {
      confirmed_wish: "我希望世界和平",
      score: -2147483648,
      realization_scenario:
        "'̵̛̠̹̩̱͕̙͉̐̓̈́͌̾g̷̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅo̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ-̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅS̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅo̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅt̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅo̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅt̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠k̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅy̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅr̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅn̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅk̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠p̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅl̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅḛ̸̢̬̹̠̘̭̓͋̆̎͌̓̀̕ͅg̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅḛ̸̢̬̹̠̘̭̓͋̆̎͌̓̀̕ͅt̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅo̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅr̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅN̵̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅg̸̨̩̠̠̘̙̐́̇̾̐̉̚̚ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ-̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅk̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅy̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠s̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅo̸̢̬̹̠̘̭̓͋̆̎͌̓̀̕ͅg̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅg̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅo̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅt̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠f̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅt̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅg̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅn̸̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠ḛ̸̢̬̹̠̘̭̓͋̆̎͌̓̀̕ͅḛ̸̢̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅM̸̢̧̺̠͒̈̓̈́͑͘͠͠g̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅl̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅw̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅn̸̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠h̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅr̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅḭ̸̸̢̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠s̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅy̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅn̸̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅn̸̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ-̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅy̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ ̷̨̧̺̠͒̈̓̈́͑͘͠͠n̸̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅ'̸̛̠̹̩̱͕̙͉̐̓̈́͌̾͌͒ͅg̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅa̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕ͅk̸̨͎̩̠̠̘̙̐́̇̾̐̉̚̚ͅh̸̢̰̬̹̠̘̭̓͋̆̎͌̓̀̕",
    };
  } else {
    sessionStorage.removeItem(stateId);
    signData.value = JSON.parse(rawSignData);
  }
}
</script>
<template>
  <div class="home-container">
    <WishResultCard v-if="signData" :signData="signData" />
  </div>
</template>
<style scoped>
.home-container {
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
  min-height: 100vh;
  display: flex;
  flex-direction: column;
}
</style>

